/*
В этом задании вам нужно создать динамическую библиотеку и использовать её.
Создайте класс Leaver, который определяет один метод leave, принимающий на вход
строку и возвращающий строку с прощанием со значением той строки, которую ему передали.
Поместите этот класс в динамическую библиотеку и воспользуйтесь им из консольного приложения 
для прощания с пользователем, который введёт своё имя.
*/
#include <iostream>
#include "Leaver.h"

int main()
{
	Leaver dynamic_leaver;
	std::string Name;
	std::cout << "Enter a name: ";
	std::cin >> Name;
	std::cout << dynamic_leaver.leave(Name);
	return 0;
}
